ConnectTest/src/Catalogs/employees/employees.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>employees</name>
  <attributes>
    <name>photo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>firstName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>lastName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>tagList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>education</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>progress</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>categoryList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>active</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>translation</name>
    <attributes>
      <name>language</name>
      <type>
        <types>CatalogRef.languages</types>
      </type>
    </attributes>
    <attributes>
      <name>firstName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>lastName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>tagList</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>education</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>progress</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>categoryList</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>photos</name>
    <attributes>
      <name>URL</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ConnectTest/src/Catalogs/employees/ManagerModule.bsl
Function attributesStructure() Export

	attributesTable = data.getValueTable();
	attributesTableForNewItem = data.getValueTable();

	data.addRowInAttributesTable(attributesTable, "photo", "photo", "string");
	data.addRowInAttributesTable(attributesTable, "firstName", "firstName", "string");
	data.addRowInAttributesTable(attributesTable, "lastName", "lastName", "string");
	data.addRowInAttributesTable(attributesTable, "education", "education", "JSON");
	data.addRowInAttributesTable(attributesTable, "progress", "progress", "JSON");
	data.addRowInAttributesTable(attributesTable, "tagList", "tagList", "JSON");
	data.addRowInAttributesTable(attributesTable, "categoryList", "categoryList", "JSON");
	data.addRowInAttributesTable(attributesTable, "translation", "translation", "valueTable");
	data.addRowInAttributesTable(attributesTable, "photos", "photos", "valueTable");

	attributesTranslation = data.getValueTable();

	data.addRowInAttributesTable(attributesTranslation, "language", "language", "ref");
	data.addRowInAttributesTable(attributesTranslation, "firstName", "firstName", "string");
	data.addRowInAttributesTable(attributesTranslation, "lastName", "lastName", "string");
	data.addRowInAttributesTable(attributesTranslation, "education", "education", "JSON");
	data.addRowInAttributesTable(attributesTranslation, "progress", "progress", "JSON");
	data.addRowInAttributesTable(attributesTranslation, "tagList", "tagList", "JSON");
	data.addRowInAttributesTable(attributesTranslation, "categoryList", "categoryList", "JSON");

	attributesPhotos = data.getValueTable();
	data.addRowInAttributesTable(attributesPhotos, "URL", "URL", "string");

	mdStruct = New Structure();
	mdStruct.Insert("translation", attributesTranslation);
	mdStruct.Insert("photos", attributesPhotos);
	mdStruct.Insert("language", New Structure("languages", "code"));

	Return New Structure("fillHolding, mdObjectName, mdType, actType, attributesTable, attributesTableForNewItem, mdStruct", True, "employees", "catalog", "write", attributesTable, attributesTableForNewItem, mdStruct);

EndFunction

Procedure PresentationFieldsGetProcessing(fields, standardProcessing)
	standardProcessing = False;
	array = New Array();
	array.Add("firstName");
	array.Add("lastName");
	array.Add("holding");
	fields = array;
EndProcedure

Procedure PresentationGetProcessing(data, presentation, standardProcessing)
	standardProcessing = False;
	presentation = "" + data.firstName + " " + data.lastName + " ("
		+ data.holding + ")";
EndProcedure
